Update SSD-Guide.md
